In [ ]:
import pandas as pd
import numpy as np

In [ ]:
credits_df = pd.read_csv('credits.csv')
movies_df = pd.read_csv('movies.csv')

In [ ]:
movies_df = movies_df.merge(credits_df, on='title')

In [ ]:
movies_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4808 entries, 0 to 4807
Data columns (total 23 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   budget                4808 non-null   int64
 1   genres                4808 non-null   object
 2   homepage              1713 non-null   object
 3   id                    4808 non-null   int64
 4   keywords              4808 non-null   object
 5   original_language     4808 non-null   object
 6   original_title        4808 non-null   object
 7   overview              4805 non-null   object
 8   popularity            4808 non-null   float64
 9   production_companies  4808 non-null   object
 10  production_countries  4808 non-null   object
 11  release_date          4807 non-null   object
 12  revenue               4808 non-null   int64
 13  runtime               4806 non-null   float64
 14  spoken_languages      4808 non-null   object
 15  status                4808 non-null   object
 16  tagline               3964 non-null   object
 17  title                 4808 non-null   object
 18  vote_average          4808 non-null   float64
 19  vote_count            4808 non-null   int64
 20  movie_id              4808 non-null   int64
 21  cast                  4808 non-null   object
 22  crew                  4808 non-null   object
dtypes: float64(3), int64(5), object(15)
memory usage: 864.1+ KB

In [ ]:
movies_df = movies_df[['movie_id', 'title', 'overview', 'genres', 'keywords', 'cast', 'crew']]

In [ ]:
movies_df.isnull().sum()

movie_id    0
title       0
overview    3
genres      0
keywords    0
cast        0
crew        0
dtype: int64

In [ ]:
movies_df.dropna(inplace=True)

<ipython-input-7-7b8d164d18f5>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  movies_df.dropna(inplace=True)

In [ ]:
movies_df.duplicated().sum()

0

In [ ]:
movies_df.iloc[0].genres

'[{"id": 28, "name": "Action"}, {"id": 12, "name": "Adventure"}, {"id": 14, "name": "Fantasy"}, {"id": 878, "name": "Science Fiction"}]'

In [ ]:
import ast

In [ ]:
def convert(obj):
    L = []
    for i in ast.literal_eval(obj):
        L.append(i['name'])
    return L # função para remover as ids e as labels, como por exemplo "name:"

In [ ]:
movies_df['genres'] = movies_df['genres'].apply(convert)
movies_df['keywords'] = movies_df['keywords'].apply(convert)
movies_df['genres']

0       [Action, Adventure, Fantasy, Science Fiction]
1                        [Adventure, Fantasy, Action]
2                          [Action, Adventure, Crime]
3                    [Action, Crime, Drama, Thriller]
4                [Action, Adventure, Science Fiction]
                            ...
4803                        [Action, Crime, Thriller]
4804                                [Comedy, Romance]
4805               [Comedy, Drama, Romance, TV Movie]
4806                                               []
4807                                    [Documentary]
Name: genres, Length: 4805, dtype: object

In [ ]:
def convert3(obj):
    L=[]
    counter = 0
    for i in ast.literal_eval(obj):
        if counter != 3:
            L.append(i['name'])
            counter += 1
        else:
            break
    return L #função parecida com o convert porém retorna apenas os 3 primeiros personagens, sem as labels
movies_df['cast']

0       [{"cast_id": 242, "character": "Jake Sully", "...
1       [{"cast_id": 4, "character": "Captain Jack Spa...
2       [{"cast_id": 1, "character": "James Bond", "cr...
3       [{"cast_id": 2, "character": "Bruce Wayne / Ba...
4       [{"cast_id": 5, "character": "John Carter", "c...
                              ...
4803    [{"cast_id": 1, "character": "El Mariachi", "c...
4804    [{"cast_id": 1, "character": "Buzzy", "credit_...
4805    [{"cast_id": 8, "character": "Oliver O\u2019To...
4806    [{"cast_id": 3, "character": "Sam", "credit_id...
4807    [{"cast_id": 3, "character": "Herself", "credi...
Name: cast, Length: 4805, dtype: object

In [ ]:
movies_df['cast'] = movies_df['cast'].apply(convert3)
movies_df['cast']

0        [Sam Worthington, Zoe Saldana, Sigourney Weaver]
1           [Johnny Depp, Orlando Bloom, Keira Knightley]
2            [Daniel Craig, Christoph Waltz, Léa Seydoux]
3            [Christian Bale, Michael Caine, Gary Oldman]
4          [Taylor Kitsch, Lynn Collins, Samantha Morton]
                              ...
4803    [Carlos Gallardo, Jaime de Hoyos, Peter Marqua...
4804         [Edward Burns, Kerry Bishé, Marsha Dietlein]
4805           [Eric Mabius, Kristin Booth, Crystal Lowe]
4806            [Daniel Henney, Eliza Coupe, Bill Paxton]
4807    [Drew Barrymore, Brian Herzlinger, Corey Feldman]
Name: cast, Length: 4805, dtype: object

In [ ]:
def fetch_directors(obj):
    L = []
    for i in ast.literal_eval(obj):
        if i['job'] == 'Director':
            L.append(i['name'])
    return L
movies_df['crew'] #função para modificar o dataframe para mostrar somente os diretores

0       [{"credit_id": "52fe48009251416c750aca23", "de...
1       [{"credit_id": "52fe4232c3a36847f800b579", "de...
2       [{"credit_id": "54805967c3a36829b5002c41", "de...
3       [{"credit_id": "52fe4781c3a36847f81398c3", "de...
4       [{"credit_id": "52fe479ac3a36847f813eaa3", "de...
                              ...
4803    [{"credit_id": "52fe44eec3a36847f80b280b", "de...
4804    [{"credit_id": "52fe487dc3a368484e0fb013", "de...
4805    [{"credit_id": "52fe4df3c3a36847f8275ecf", "de...
4806    [{"credit_id": "52fe4ad9c3a368484e16a36b", "de...
4807    [{"credit_id": "58ce021b9251415a390165d9", "de...
Name: crew, Length: 4805, dtype: object

In [ ]:
movies_df['crew'] = movies_df['crew'].apply(fetch_directors)

In [ ]:
movies_df['crew']

0                                [James Cameron]
1                               [Gore Verbinski]
2                                   [Sam Mendes]
3                            [Christopher Nolan]
4                               [Andrew Stanton]
                          ...
4803                          [Robert Rodriguez]
4804                              [Edward Burns]
4805                               [Scott Smith]
4806                               [Daniel Hsia]
4807    [Brian Herzlinger, Jon Gunn, Brett Winn]
Name: crew, Length: 4805, dtype: object

In [ ]:
movies_df['overview'] = movies_df['overview'].apply(lambda x: x.split())

In [ ]:
movies_df['genres'] = movies_df['genres'].apply(lambda x: [i.replace(" ","") for i in x])
movies_df['keywords'] = movies_df['keywords'].apply(lambda x: [i.replace(" ","") for i in x])
movies_df['cast'] = movies_df['cast'].apply(lambda x: [i.replace(" ","") for i in x])
movies_df['crew'] = movies_df['crew'].apply(lambda x: [i.replace(" ","") for i in x])
# trata as células do df, removendo espaços em branco

In [ ]:
movies_df['tags'] = movies_df['overview'] + movies_df['genres'] + movies_df['keywords'] + movies_df['cast'] + movies_df['crew']

In [ ]:

df = movies_df[['movie_id', 'title', 'tags', 'genres']]

In [ ]:
df['tags'] = df['tags'].apply(lambda x: ' '.join(x))

<ipython-input-22-b20ed34e6d61>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['tags'] = df['tags'].apply(lambda x: ' '.join(x))

In [ ]:

df['tags'] = df['tags'].apply(lambda x: x.lower())

<ipython-input-23-f3ac90a1e795>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['tags'] = df['tags'].apply(lambda x: x.lower())

In [ ]:
from sklearn.feature_extraction.text import CountVectorizer
cv = CountVectorizer(max_features=5000, stop_words='english')

In [ ]:

cv.fit_transform(df['tags']).toarray().shape

(4805, 5000)

In [ ]:
vectors = cv.fit_transform(df['tags']).toarray()

In [ ]:

import nltk
from nltk.stem.porter import PorterStemmer

ps = PorterStemmer() #inicializa o porterstemmer, que remove os sufixos e inflexões da palavra, a fim de simplificá-la

In [ ]:
def stem(text):
    y = []
    for i in text.split():
        y.append(ps.stem(i))
    return ' '.join(y) #aplica o porterstemmer na string

In [ ]:

df['tags'] = df['tags'].apply(stem)

<ipython-input-29-9c043b76a2e3>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['tags'] = df['tags'].apply(stem)

In [ ]:
from sklearn.metrics.pairwise import cosine_similarity
similarity = cosine_similarity(vectors) #analisa a similaridade entre as tags dos filmes

In [ ]:
sorted(list(enumerate(similarity[0])), reverse=True, key=lambda x: x[1])[1:6]

[(539, 0.26089696604360174),
 (507, 0.25302403842552984),
 (1194, 0.25226248955475644),
 (1216, 0.2480694691784169),
 (582, 0.24397501823713333)]

In [ ]:
def recommend(movie):
    movie_index = df[df['title'] == movie].index[0]
    distances = similarity[movie_index]
    movies_list = sorted(list(enumerate(distances)), reverse=True, key=lambda x: x[1])[1:6]
    for i in movies_list:
        print(df.iloc[i[0]].title) # analisa as similaridades entre o filme escolhido e apresenta os 5 filmes mais semelhantes

In [ ]:
def recomendagenero(movie, genero):
    listamostra = []
    conta =0
    movie_index = df[df['title'] == movie].index[0]
    distances = similarity[movie_index]
    movies_list = sorted(list(enumerate(distances)), reverse=True, key=lambda x: x[1])[1:] #cria uma lista ordenada com base na similaridade, excluindo o primeiro indice pois é o mesmo filme
    for i in movies_list:
      if genero in df.iloc[i[0]].genres:
        listamostra.append(df.iloc[i[0]].title) #para cada filme que possui o mesmo genero, é adicionado o titulo do filme para uma lista vazia
        conta += 1
        if conta == 5:
          break
    for i in listamostra:
        print(i)

In [ ]:
recommend('Avatar')

Titan A.E.
Independence Day
Small Soldiers
Aliens vs Predator: Requiem
Battle: Los Angeles

In [ ]:
genero = input('genero:')
nome = input('filme:')
recomendagenero(nome, genero)

genero:Fantasy
filme:Avatar
Small Soldiers
Aliens vs Predator: Requiem
Krull
Lifeforce
The Fifth Element